jp.go.nict.langrid.client.soap.test/test/jp/go/nict/langrid/client/soap/io/TranslationService.req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ser="servicegrid:servicetype:nict.nlp:Translation">
  <soapenv:Header>

  </soapenv:Header>
  <soapenv:Body>
    <ser:translate soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

      <sourceLang xsi:type="xsd:string">en</sourceLang>


      <targetLang xsi:type="xsd:string">ja</targetLang>


      <source xsi:type="xsd:string">hello</source>


    </ser:translate>
  </soapenv:Body>
</soapenv:Envelope>
